Repository: niklasschildhauer/Trittstufe
Catalog: 1_iOS/Trittstufe/Trittstufe/*.lproj/Localizable.strings
Languages: de

# QRCodeScannerViewController_Error_Title
source: Scanning is not available
de: Scannen ist nich möglich

# QRCodeScannerViewController_Error_Message
source: Your device does not support scanning a code from an item.
de: Das Scannen eines QR Codes wird von deinem Gerät nicht unterstützt.

# ConfigurationViewController_Description
source: The development of the automatically extendable step is still in the prototype phase. For this reason, the backend connection has not yet been completed. For this reason, please enter the necessary information to establish a connection to the step. Alternatively, you can also scan the QR code on the step. This contains all the necessary information.
de: Die Entwicklung der automatisch ausfahrbaren Trittstufe ist noch in der Prototypenphase. Aus diesem Grund wurde die Backendanbindung noch nicht fertiggestellt. Bitte gebe aus diesem Grund die nötigen Informationen ein, um eine Verbindung zur Trittstufe aufzubauen. Alternativ können Sie auch die QR-Code an der Trittstufe scannen. In diesem sind alle nötigen Informationen hinterlegt.

# HomeViewController_InformationView_NotConnected
source: No connection could be established to the vehicle. Please check the network.
de: Es konnte keine Verbindung zum Fahrzeug hergestellt werden. Bitte überprüfe das Netzwerk.

# HomeViewController_InformationView_InLocalization
source: The vehicle is too far away. Please move closer to the vehicle.
de: Das Fahrzeug ist zu weit entfernt. Bitte gehen Sie näher zum Fahrzeug.

# HomeViewController_ActionButton_NotConnected
source: Edit configuration
de: Konfiguration bearbeiten

# HomeViewController_ActionButton_InLocalization
source: Already on the vehicle?
de: Bereits am Fahrzeug?

# HomeViewController_ActionButton_ReadyToUnlock
source: Open other side?
de: Andere Seite öffnen?

# HomeViewController_LogoutButton
source: Logout
de: Abmelden

# AuthenticationController_LoginButton
source: Login
de: Anmelden

# ConfigurationController_SubmitButton
source: Confirm
de: Bestätigen

# ConfigurationController_Title
source: Configuration
de: Konfiguration

# ConfigurationController_QRButton
source: Open QR-Scanner
de: QR-Scanner öffnen

# NFCReaderService_Instruction
source: Hold your iPhone to the NFC tag on the step
de: Halte dein iPhone an den NFC Tag der Trittstufe

# NFCReaderService_Invalid
source: Tag is not valid
de: Tag konnte nicht gelesen werden

# NFCReaderService_Valid
source: Step successful identified
de: Stufe wurde erfolgreich identifiziert

# CarStepIdentification_Right
source: Right
de: Rechts

# CarStepIdentification_Left
source: Left
de: Links

# Position_close
source: expand step
de: Stufe einfahren

# Position_open
source: retract step
de: Stufe ausfahren

# ConfigurationPresenter_internalError
source: An internal error occurred.
de: Ein interner Fehler ist aufgetreten.

# ConfigurationPresenter_internalErrorTitle
source: Internal Error
de: Interner Fehler

# ConfigurationPresenter_inputError
source: Please ensure that all input fields are completed.
de: Bitte stelle sicher, dass alle Felder ausgefüllt sind.

# ConfigurationPresenter_inputErrorTitle
source: Input error
de: Eingabefehler

# AuthenticationPresenter_noNetwork
source: No network. Please check your internet connection.
de: Keine Internetverbindung. Bitte stelle sicher, dass du mit dem Internet verbunden bist.

# AuthenticationPresenter_noNetworkTitle
source: No internet
de: Netzwerkfehler

# AuthenticationPresenter_wrongCredentials
source: The login credentials were invalid.
de: Deine Eingabedaten passen zu keinem Nutzer.

# AuthenticationPresenter_wrongCredentialsTitle
source: Wrong credentials
de: Falsches Passwort oder Nutzername

# AuthenticationPresenter_identifiy
source: Identify yourself
de: Bitte identifiziere dich

# HomePresenter_NFCReaderFail
source: Unable to start NFC Reader.
de: NFC Reader konnte nicht gestartet werden.

# HomePresenter_NFCReaderFailTitle
source: NFC Reader failed
de: NFC-Reader Fehler

# AuthenticationViewController_ChangeConfig
source: Change configuration
de: Konfiguration ändern

# AuthenticationViewController_Title
source: Location permissions
de: Anmelden

# AuthenticationViewController_Password
source: Password
de: Passwort

# AuthenticationViewController_Settings
source: Open settings
de: Einstellungen öffnen

# AuthenticationViewController_Text1
source: The app needs your location to locate the rolling chassis. For this reason, we ask you to share your location.
de: Die App benötigt Ihren Standort, zum lokalisieren des Rolling-Chassis. Aus diesem Grund bitten wir um Freigabe des Standorts.

# AuthenticationViewController_Text2
source: The app cannot work without location sharing. Please go to the settings and share the location.
de: Die App kann ohne Standortfreigabe nicht funktionieren. Bitte gehen Sie in die Einstellungen und geben den Standort frei.
